/*
27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
452 -> 11
82 -> 10
9012 -> 12
*/

System.Console.WriteLine("Введите любое число: ");
int num = Convert.ToInt32(Console.ReadLine());

